results/data/jvm-static/erik-laptop/quarkus-io-thread-45000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.135ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.133ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.132ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.137ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms  507.07us   4.53ms   63.14%
    Req/Sec    11.84k   654.95    14.67k    73.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.51ms
 90.000%    1.83ms
 99.000%    2.33ms
 99.900%    2.83ms
 99.990%    3.40ms
 99.999%    3.93ms
100.000%    4.53ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.154     0.000000            1         1.00
       0.491     0.100000       225138         1.11
       0.639     0.200000       449597         1.25
       0.780     0.300000       673485         1.43
       0.924     0.400000       899072         1.67
       1.081     0.500000      1122634         2.00
       1.164     0.550000      1234574         2.22
       1.249     0.600000      1347455         2.50
       1.334     0.650000      1459173         2.86
       1.420     0.700000      1571477         3.33
       1.509     0.750000      1684045         4.00
       1.554     0.775000      1739865         4.44
       1.601     0.800000      1796582         5.00
       1.650     0.825000      1852682         5.71
       1.703     0.850000      1908723         6.67
       1.761     0.875000      1964762         8.00
       1.792     0.887500      1992658         8.89
       1.825     0.900000      2020484        10.00
       1.860     0.912500      2048188        11.43
       1.899     0.925000      2076357        13.33
       1.942     0.937500      2104689        16.00
       1.965     0.943750      2118533        17.78
       1.990     0.950000      2132514        20.00
       2.018     0.956250      2146565        22.86
       2.049     0.962500      2160387        26.67
       2.085     0.968750      2174634        32.00
       2.105     0.971875      2181480        35.56
       2.129     0.975000      2188820        40.00
       2.155     0.978125      2195667        45.71
       2.185     0.981250      2202450        53.33
       2.225     0.984375      2209430        64.00
       2.251     0.985938      2213094        71.11
       2.277     0.987500      2216513        80.00
       2.307     0.989062      2219942        91.43
       2.341     0.990625      2223372       106.67
       2.383     0.992188      2226879       128.00
       2.407     0.992969      2228627       142.22
       2.435     0.993750      2230476       160.00
       2.465     0.994531      2232208       182.86
       2.501     0.995313      2233937       213.33
       2.541     0.996094      2235631       256.00
       2.567     0.996484      2236537       284.44
       2.593     0.996875      2237405       320.00
       2.623     0.997266      2238259       365.71
       2.661     0.997656      2239168       426.67
       2.701     0.998047      2240026       512.00
       2.723     0.998242      2240449       568.89
       2.749     0.998437      2240931       640.00
       2.771     0.998633      2241331       731.43
       2.801     0.998828      2241789       853.33
       2.837     0.999023      2242221      1024.00
       2.855     0.999121      2242425      1137.78
       2.877     0.999219      2242656      1280.00
       2.899     0.999316      2242866      1462.86
       2.927     0.999414      2243083      1706.67
       2.969     0.999512      2243300      2048.00
       2.995     0.999561      2243407      2275.56
       3.023     0.999609      2243516      2560.00
       3.057     0.999658      2243625      2925.71
       3.103     0.999707      2243735      3413.33
       3.155     0.999756      2243852      4096.00
       3.187     0.999780      2243900      4551.11
       3.227     0.999805      2243956      5120.00
       3.263     0.999829      2244011      5851.43
       3.297     0.999854      2244065      6826.67
       3.343     0.999878      2244119      8192.00
       3.377     0.999890      2244146      9102.22
       3.411     0.999902      2244173     10240.00
       3.443     0.999915      2244201     11702.86
       3.489     0.999927      2244228     13653.33
       3.525     0.999939      2244257     16384.00
       3.553     0.999945      2244269     18204.44
       3.571     0.999951      2244283     20480.00
       3.599     0.999957      2244298     23405.71
       3.647     0.999963      2244310     27306.67
       3.671     0.999969      2244324     32768.00
       3.693     0.999973      2244332     36408.89
       3.727     0.999976      2244339     40960.00
       3.751     0.999979      2244345     46811.43
       3.791     0.999982      2244352     54613.33
       3.843     0.999985      2244359     65536.00
       3.859     0.999986      2244362     72817.78
       3.899     0.999988      2244365     81920.00
       3.925     0.999989      2244369     93622.86
       3.951     0.999991      2244372    109226.67
       3.991     0.999992      2244375    131072.00
       4.023     0.999993      2244377    145635.56
       4.051     0.999994      2244379    163840.00
       4.091     0.999995      2244381    187245.71
       4.139     0.999995      2244382    218453.33
       4.175     0.999996      2244384    262144.00
       4.179     0.999997      2244385    291271.11
       4.199     0.999997      2244386    327680.00
       4.211     0.999997      2244388    374491.43
       4.211     0.999998      2244388    436906.67
       4.211     0.999998      2244388    524288.00
       4.271     0.999998      2244389    582542.22
       4.271     0.999998      2244389    655360.00
       4.315     0.999999      2244390    748982.86
       4.315     0.999999      2244390    873813.33
       4.315     0.999999      2244390   1048576.00
       4.371     0.999999      2244391   1165084.44
       4.371     0.999999      2244391   1310720.00
       4.371     0.999999      2244391   1497965.71
       4.371     0.999999      2244391   1747626.67
       4.371     1.000000      2244391   2097152.00
       4.535     1.000000      2244392   2330168.89
       4.535     1.000000      2244392          inf
#[Mean    =        1.128, StdDeviation   =        0.507]
#[Max     =        4.532, Total count    =      2244392]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2697301 requests in 1.00m, 187.78MB read
Requests/sec:  44954.59
Transfer/sec:      3.13MB