results/data/jvm-static/erik-laptop/quarkus-io-thread-50000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.149ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.106ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.159ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.150ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.13ms  523.80us   7.32ms   64.30%
    Req/Sec    13.14k   767.47    17.56k    73.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.54ms
 90.000%    1.85ms
 99.000%    2.37ms
 99.900%    2.87ms
 99.990%    3.91ms
 99.999%    5.89ms
100.000%    7.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.143     0.000000            1         1.00
       0.477     0.100000       250325         1.11
       0.649     0.200000       500275         1.25
       0.785     0.300000       748640         1.43
       0.924     0.400000       998395         1.67
       1.076     0.500000      1246988         2.00
       1.154     0.550000      1372923         2.22
       1.236     0.600000      1497635         2.50
       1.331     0.650000      1621883         2.86
       1.438     0.700000      1746265         3.33
       1.541     0.750000      1871511         4.00
       1.585     0.775000      1933146         4.44
       1.630     0.800000      1996122         5.00
       1.678     0.825000      2058327         5.71
       1.729     0.850000      2120825         6.67
       1.783     0.875000      2182410         8.00
       1.813     0.887500      2213303         8.89
       1.846     0.900000      2245306        10.00
       1.880     0.912500      2275817        11.43
       1.919     0.925000      2306940        13.33
       1.967     0.937500      2337866        16.00
       1.995     0.943750      2353695        17.78
       2.023     0.950000      2369535        20.00
       2.051     0.956250      2385434        22.86
       2.079     0.962500      2400331        26.67
       2.113     0.968750      2416478        32.00
       2.131     0.971875      2423684        35.56
       2.153     0.975000      2431433        40.00
       2.181     0.978125      2439404        45.71
       2.215     0.981250      2447222        53.33
       2.257     0.984375      2454780        64.00
       2.283     0.985938      2458829        71.11
       2.311     0.987500      2462737        80.00
       2.343     0.989062      2466573        91.43
       2.379     0.990625      2470437       106.67
       2.421     0.992188      2474243       128.00
       2.447     0.992969      2476318       142.22
       2.473     0.993750      2478160       160.00
       2.505     0.994531      2480102       182.86
       2.541     0.995313      2482058       213.33
       2.585     0.996094      2484016       256.00
       2.611     0.996484      2484985       284.44
       2.637     0.996875      2485994       320.00
       2.665     0.997266      2486938       365.71
       2.697     0.997656      2487918       426.67
       2.733     0.998047      2488863       512.00
       2.755     0.998242      2489341       568.89
       2.779     0.998437      2489847       640.00
       2.807     0.998633      2490347       731.43
       2.837     0.998828      2490822       853.33
       2.873     0.999023      2491297      1024.00
       2.895     0.999121      2491532      1137.78
       2.925     0.999219      2491777      1280.00
       2.963     0.999316      2492017      1462.86
       3.025     0.999414      2492261      1706.67
       3.097     0.999512      2492503      2048.00
       3.147     0.999561      2492626      2275.56
       3.199     0.999609      2492746      2560.00
       3.271     0.999658      2492870      2925.71
       3.345     0.999707      2492994      3413.33
       3.427     0.999756      2493112      4096.00
       3.469     0.999780      2493176      4551.11
       3.531     0.999805      2493234      5120.00
       3.595     0.999829      2493294      5851.43
       3.683     0.999854      2493355      6826.67
       3.805     0.999878      2493416      8192.00
       3.867     0.999890      2493447      9102.22
       3.931     0.999902      2493478     10240.00
       4.007     0.999915      2493507     11702.86
       4.175     0.999927      2493539     13653.33
       4.323     0.999939      2493569     16384.00
       4.411     0.999945      2493584     18204.44
       4.503     0.999951      2493600     20480.00
       4.631     0.999957      2493614     23405.71
       4.815     0.999963      2493629     27306.67
       4.919     0.999969      2493644     32768.00
       5.099     0.999973      2493652     36408.89
       5.243     0.999976      2493660     40960.00
       5.395     0.999979      2493667     46811.43
       5.451     0.999982      2493675     54613.33
       5.511     0.999985      2493682     65536.00
       5.563     0.999986      2493686     72817.78
       5.639     0.999988      2493690     81920.00
       5.855     0.999989      2493694     93622.86
       6.023     0.999991      2493698    109226.67
       6.279     0.999992      2493701    131072.00
       6.311     0.999993      2493703    145635.56
       6.355     0.999994      2493705    163840.00
       6.375     0.999995      2493707    187245.71
       6.387     0.999995      2493709    218453.33
       6.451     0.999996      2493711    262144.00
       6.459     0.999997      2493712    291271.11
       6.751     0.999997      2493713    327680.00
       6.887     0.999997      2493714    374491.43
       6.895     0.999998      2493715    436906.67
       6.931     0.999998      2493716    524288.00
       6.931     0.999998      2493716    582542.22
       7.063     0.999998      2493717    655360.00
       7.063     0.999999      2493717    748982.86
       7.095     0.999999      2493718    873813.33
       7.095     0.999999      2493718   1048576.00
       7.095     0.999999      2493718   1165084.44
       7.131     0.999999      2493719   1310720.00
       7.131     0.999999      2493719   1497965.71
       7.131     0.999999      2493719   1747626.67
       7.131     1.000000      2493719   2097152.00
       7.131     1.000000      2493719   2330168.89
       7.319     1.000000      2493720   2621440.00
       7.319     1.000000      2493720          inf
#[Mean    =        1.133, StdDeviation   =        0.524]
#[Max     =        7.316, Total count    =      2493720]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2996960 requests in 1.00m, 208.64MB read
Requests/sec:  49949.33
Transfer/sec:      3.48MB